Revit 2024 API
BuiltInFailures.WallFailures.ShorterThanMinWallFailure Property
 Wall is shorter than minimum height allowed by its type.\nIt is [Length] and must be at least [Length].
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId ShorterThanMinWallFailure { get; }
Visual Basic
Public Shared ReadOnly Property ShorterThanMinWallFailure As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ ShorterThanMinWallFailure {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.WallFailures Class
Autodesk.Revit.DB Namespace